In [1]:
import pandas as pd
# Create a new dataframe
df = pd.DataFrame({
        'A' : [11,-1,2,6,19],
        'B' : [22,12,14,5,3],
        'C' : ['a','e','f','b','v']
    })
# Define a function that takes a scalar(element's value) and returns a scalar(modified value)
def replace_by_square(element): 
    # Returns a scalar value which is the modified value for that particular element
    return element*element
# Using applymap() modify the dataframe by replacing the elements by its square, element-wise.
df.select_dtypes(include = ['int']).applymap(replace_by_square)

     A    B
0  121  484
1    1  144
2    4  196
3   36   25
4  361    9

In [3]:
df=df.select_dtypes(include = ['int']).applymap(replace_by_square)

In [4]:
df

     A    B
0  121  484
1    1  144
2    4  196
3   36   25
4  361    9